In [21]:
import numpy as np
import pandas as pd
import seaborn as sns

## 3.01 Pandas Object
- Series - values with row names/indices
- Data Frame - made of up a set of series with column names
- Index - immutable array for both series and data frame used to access and modify data

### Series
- Series is a spealization of python dictionary. Series has explicitly defined indices compared to implit ones in numpy. So the indices can be customized
- Create series by pd.series(values, index = ...)
- ```s.values, s.index``` to access values and indices.... note the subtle variation in using ```loc and iloc```
- ```loc``` is explicit index
- ```iloc``` is implicit index
- Series as dictionary and other ways to create series

In [7]:

data = pd.Series([0.25, 0.5, 0.75, 1.0])
print(data, "\n")
print(data.values, "\n")
print(data.index)

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

[0.25 0.5  0.75 1.  ]

RangeIndex(start=0, stop=4, step=1)
0.25

In [20]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
print(data['a'])
print(data[0])
print(data.iloc[0]) 
print(data.loc['a']) 

# note that data.loc[0]

0.25
0.25
0.25
0.25

#### Other ways to create series

In [15]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population['California': 'Florida']

26448193

In [22]:
a = pd.Series([2, 4, 6])
b = pd.Series(5, index=[100, 200, 300])
c = pd.Series({2:'a', 1:'b', 3:'c'})
d= pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2]) # series filled only with explicityl specified indices
a,b,c,d

(0    2
 1    4
 2    6
 dtype: int64,
 100    5
 200    5
 300    5
 dtype: int64,
 2    a
 1    b
 3    c
 dtype: object,
 3    c
 2    a
 dtype: object)

####  Data Frame 
- Data frame is a sequece of aligned series. As a dictionary maps keys to values, so the data frame maps column names to series of column data
- ```df.index, df.columns``` to get the rownames/indices and column names
- ```df['col name']``` to access columns

In [33]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
states = pd.DataFrame({'population': population,
                       'area': area})
print(states)
print(states.index)
print(states.columns, "\n")
print(states['area'])

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995
Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')
Index(['population', 'area'], dtype='object')

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

#### Constructing data frames
- ```pd.DataFrame[series, columns = [col names]```
- From dictionaries --- missing values filled with NaNs
- From 2d numpy arrays ```pd.DataFrame[values, columns = [col names], index = [row names]```
- From numpy structure array (refer to book)

In [42]:
# From series object
pd.DataFrame(population, columns=['population'])

# From list of dictionaries
data = [{'a': i, 'b': 2 * i} for i in range(3)]
pd.DataFrame(data)

# From dict of series objects
pd.DataFrame({'population': population, 
              'area': area})

# From 2d numpy arrays
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.501791  0.197005
b  0.178450  0.037953
c  0.781266  0.989460

##  3.02 Data Indexing and Selection
- Quite similar to those done with numpy with a few quirks
- ```loc``` is explicit index, ```iloc``` is implicit index
- data selection in data frames - ```data.values[i,j], data.T

In [46]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data['a'] # access data
'a' in data # check
data['e'] = 1.25 # add new data

data['a':'c'] # slicing using explicit index
data[0:3] # slicing using implicit index
data[(data > 0.3) & (data < 0.8)] # masking

a    0.25
b    0.50
c    0.75
dtype: float64

In [54]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data
print(data[1]) # explicit
print(data.loc[1]) # explicit
print(data.iloc[0],"\n") # implicit

a
a
a

In [61]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})

data['area'] == data.area # this checks whole object
data['area'] is data.area # this checks individual values
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [79]:
data.loc['Texas':'Florida','pop':'density']

               pop     density
Texas     26448193   38.018740
New York  19651127  139.076746
Florida   19552860  114.806121

In [70]:
data.iloc[1,1]

26448193

In [84]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [93]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

## 3.03 Operations in Pandas
- ```A.add(B, fill_value=0)``` adding two series and fill missing elements with 0
- ```fill = A.stack().mean()   A.add(B, fill_value=fill)``` adding two DFs and fill missing elements with mean of one
- Operating between series and data frames --- review

## 3.04 Handling Missing Values
- ```None``` is a python object for missing data and can be used only in array with datatype 'object'.
- ```NaN``` is a special floating point value to indicate missing values. Any operation with it yield nan.
- If NaN is present in an array, the dtype automatically becomes float
- ```isnull()``` Generate a boolean mask indicating missing values
- ```notnull()```Opposite of isnull()
- ```dropna()``` Return a filtered version of the data --- for dataframes it drops the entire row and col
    - ```df.dropna(axis = 'columns' or 'rows')``` drops specific col or row with NAs
    - ```df.dropna(axis = 'columns' or 'rows', how = 'all')``` drops specific col or row with all NAs
    - ```df.dropna(axis = 'columns' or 'rows', thresh = 3)``` keeps min number of non null values
- ```df.fillna()``` Return a copy of the data with missing values filled or imputed    
    - ```df.fillna(0)``` fill with zeros
    - ```df.fillna(method = 'ffill' or 'bfill', axis = 0,1)``` fill with previous or next values, axis = 0 (along cols), 1 (along rows)

In [100]:
vals2 = np.array([1, np.nan, 3, 4]) 
print(vals2.dtype)
print(vals2.sum(), vals2.max())
print(np.nansum(vals2), np.nanmax(vals2))

float64
nan nan
8.0 4.0

In [116]:
# NaN and None
a = pd.Series([1, np.nan, 2, None])
print("a dtype: ", a.dtype)  # since NAs are present, it is float

x = pd.Series(range(2), dtype=int)
print("x dtype: ", x.dtype) # int type

x[0] = None

print("x dtype: ", x.dtype) # now it is float type coz of None

a dtype:  float64
x dtype:  int32
x dtype:  float64

### Operating on Null values

In [121]:
data = pd.Series([1, np.nan, 'hello', None])
print(data.isnull(), "\n")
print(data.notnull(), "\n")
data.dropna()

0    False
1     True
2    False
3     True
dtype: bool

0     True
1    False
2     True
3    False
dtype: bool

0        1
2    hello
dtype: object

## 3.05 Heirarchical Indexing

## 3.08 Aggregation and Grouping
- ```df.mean(axis = 'rows')``` mean for each column
- ```count(), first(), last(), mean()....etc ```
- **Split, Apply, Combine**
- ```df.groupby('some factor').mean() ```
- **aggregate(), filter(), transform(), and apply()**
    - ```df.groupby('factor').aggregate(['min', np.median, max])```
    - ```df.groupby('factor').apply(some custom function)```
    - ```df.groupby('factor').filter(some custom function)```
    - Can also group by specifying the index or based on a dictionary
-  Refer book for example - grouping with two levels and then unstacking

In [5]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [19]:
planets.mean(axis = 'rows')
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [25]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [27]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [29]:
# Group by method and then median of orbital period 
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [30]:
# Iterate over groups
# group is a data frame for each factor (method) in this case

for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [31]:
# Group by method, and get summary of year column
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [32]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [35]:
# Aggregate - allows for more flexibility
# takes string, function, or list
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [47]:
# filter based on condition

def filter_func(x):
    return x['data2'].std() > 4

df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [50]:
# Transformation - center the data by subtracting mean

df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [51]:
# apply - similar to filter where some function is applied to the values
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9